# Terraform environment at24
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24]
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24]
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_storage_account.use_lease[0]: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24]
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24]
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at24]
module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at24]
module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at24]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rbac.azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "648fad02-9adb-48a5-8ea8-0a1faf0d8f4e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["226b2bbc-a0bd-4cdc-9d66-27822e900f71"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "226b2bbc-a0bd-4cdc-9d66-27822e900f71"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["23120df0-6945-49e6-b62e-3c3a797e5c51"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23120df0-6945-49e6-b62e-3c3a797e5c51"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.AccessManagement/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at24/altinn.accessmanagement.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at24_altinn.accessmanagement.tfstate.tfplan`